pascalacco/farm/Projets_L4x/AudioUsb/Drivers/BSP/stm32l475e_iot01_audio_in_out.c
	if (Instance >= AUDIO_OUT_INSTANCES_NBR)
	{
		status = BSP_ERROR_WRONG_PARAM;
	}
	else if ((Instance == 0U) && ((AudioInit->BitsPerSample == AUDIO_RESOLUTION_32b) || (AudioInit->BitsPerSample == AUDIO_RESOLUTION_8b)))
	{
		status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
	}
	else if ((Instance == 0U) && (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET) &&
			((Audio_In_Ctx[0].SampleRate != AudioInit->SampleRate) || (Audio_In_Ctx[0].BitsPerSample != AudioInit->BitsPerSample)))
	{
		status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
	}
	else if ((Instance == 0U) && (Audio_In_Ctx[1].State != AUDIO_IN_STATE_RESET) &&
			(Audio_In_Ctx[1].SampleRate != AudioInit->SampleRate))
	{
		status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
	}
	else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_RESET)
	{
		status = BSP_ERROR_BUSY;
	}
	else
	{

		if (status == BSP_ERROR_NONE)
		{
			/* Fill audio out context structure */
			Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
			Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
			Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
			Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
			Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;
		}

		if (status == BSP_ERROR_NONE)
		{
			if (MX_DAC1_ClockConfig(&hdac, AudioInit->SampleRate) != HAL_OK)
			{
				status = BSP_ERROR_CLOCK_FAILURE;
			}
		}

		if (status == BSP_ERROR_NONE)
		{
#if (USE_HAL_DAC_REGISTER_CALLBACKS == 0)
			//TODO DAC_MspInit(&hdac);
#else
			/* Register the SAI MSP Callbacks */
			if (AudioOut_IsMspCbValid[Instance] == 0U)
			{
				if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
				{
					status = BSP_ERROR_PERIPH_FAILURE;
				}
			}
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
		}

		if (status == BSP_ERROR_NONE)
		{

			/* DAC peripheral initialization */
			if (MX_DAC1_Init(&hdac) != HAL_OK)
			{
				status = BSP_ERROR_PERIPH_FAILURE;
			}
#if (USE_HAL_DAC_REGISTER_CALLBACKS == 1)     //TODO
			/* Register SAI TC, HT and Error callbacks */
			else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
			{
				status = BSP_ERROR_PERIPH_FAILURE;
			}
			else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback) != HAL_OK)
			{
				status = BSP_ERROR_PERIPH_FAILURE;
			}
			else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
			{
				status = BSP_ERROR_PERIPH_FAILURE;
			}
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
			else
			{
				/* Update audio out context state */
				Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
			}
		} // PAS d'ERREUR
	}

	return status;
}

/**
  * @brief  De-initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_DeInit(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_RESET)
  {
    /* Reset audio codec if not currently used by audio in instance 0 */
    if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
    {
     //TODO ?
    }

    if (status == BSP_ERROR_NONE)
    {
      /* DAC peripheral de-initialization */
      if (HAL_DAC_DeInit(&hdac) != HAL_OK)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      /* De-initialize audio codec if not currently used by audio in instance 0 */
      else
      {
#if (USE_HAL_DAC_REGISTER_CALLBACKS == 0)
        //TODO DAC_MspDeInit(&hdac);
#endif /* (USE_HAL_DAC_REGISTER_CALLBACKS == 0) */
        if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
        {

        }
      }

      if (status == BSP_ERROR_NONE)
      {
        /* Update audio out context */
        Audio_Out_Ctx[Instance].State  = AUDIO_OUT_STATE_RESET;
        Audio_Out_Ctx[Instance].IsMute = 0U;
      }
    }
  }
  else
  {
    /* Nothing to do */
  }
  return status;
}

/**
  * @brief  Start playing audio stream from a data buffer for a determined size.
  * @param  Instance Audio out instance.
  * @param  pData Pointer on data buffer.
  * @param  NbrOfBytes Size of buffer in bytes. Maximum size is 65535 bytes.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Play(uint32_t Instance, uint8_t* pData, uint32_t NbrOfBytes)
{
  int32_t  status = BSP_ERROR_NONE;
  uint16_t NbrOfDmaDatas;

  if ((Instance >= AUDIO_OUT_INSTANCES_NBR) || (pData == NULL) || (NbrOfBytes > 65535U))
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio out state */
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_STOP)
  {
    status = BSP_ERROR_BUSY;
  }
  else
  {
    /* Compute number of DMA data to transfer according resolution */
    if (Audio_Out_Ctx[Instance].BitsPerSample == AUDIO_RESOLUTION_16b)
    {
      NbrOfDmaDatas = (uint16_t) (NbrOfBytes / 2U);
    }
    else /* AUDIO_RESOLUTION_24b */
    {
      NbrOfDmaDatas = (uint16_t) (NbrOfBytes / 4U);
    }

    /* Initiate a DMA transfer of audio samples towards the serial audio interface */
    if (HAL_DAC_Transmit_DMA(&hdac,(uint16_t *) pData, NbrOfDmaDatas) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
     else
    {
      /* Update audio out state */
      Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_PLAYING;
    }
  }
  return status;
}

/**
  * @brief  Pause playback of audio stream.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Pause(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio out state */
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_PLAYING)
  {
    status = BSP_ERROR_BUSY;
  }
  /* Pause DMA transfer of audio samples towards the DAC */
  else if (HAL_DAC_DMAPause(&hdac) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    /* Update audio out state */
    Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_PAUSE;
  }
  return status;
}

/**
  * @brief  Resume playback of audio stream.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Resume(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

