pascalacco/farm/Projets_L4x/AudioUsb/Drivers/BSP/stm32l475e_iot01_audio_in_out.c
	  /* Prevent unused argument(s) compilation warning */
	  UNUSED(hdac);

	  /* Set the TIMx configuration according to the audio frequency */
	  if((SampleRate == AUDIO_FREQUENCY_11K) || (SampleRate == AUDIO_FREQUENCY_22K) || (SampleRate == AUDIO_FREQUENCY_44K) ||
	     (SampleRate == AUDIO_FREQUENCY_88K) || (SampleRate == AUDIO_FREQUENCY_176K))
	  {
		  return HAL_ERROR;
	  }
	  else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K or AUDIO_FREQUENCY_192K */
	  {
	    // TIMx clock config
		  if (MX_TIMx_Init(htim) != HAL_OK) return HAL_ERROR ;
	  }

	  return HAL_OK;
};

/**
  * @brief DAC1 Initialization Function
  * @param None
  * @retval None
  */
HAL_StatusTypeDef MX_DAC1_Init(DAC_HandleTypeDef* hdac)
{


  DAC_ChannelConfTypeDef sConfig = {0};

  /** DAC Initialization
  */
  hdac->Instance = DAC1;
  if (HAL_DAC_Init(hdac) != HAL_OK)
  {
	  return HAL_ERROR;
  }
  /** DAC channel OUT2 config
  */
  sConfig.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
  sConfig.DAC_Trigger = DAC_TRIGGER_T2_TRGO;
  sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
  sConfig.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_DISABLE;
  sConfig.DAC_UserTrimming = DAC_TRIMMING_FACTORY;
  if (HAL_DAC_ConfigChannel(hdac, &sConfig, DAC_CHANNEL_2) != HAL_OK)
  {
	  return HAL_ERROR;
  }
  return HAL_OK;
}

HAL_StatusTypeDef HAL_DAC_Transmit_DMA(DAC_HandleTypeDef* hdac, uint16_t* pData, uint16_t NbrOfDMAData)
{
	//TODO
	return HAL_OK;
};

HAL_StatusTypeDef HAL_DAC_DMAPause(DAC_HandleTypeDef* hdac)
{
	//TODO
	return HAL_OK;

};

HAL_StatusTypeDef HAL_DAC_DMAResume(DAC_HandleTypeDef* hdac)
{
	//TODO
	return HAL_OK;

};

HAL_StatusTypeDef HAL_DAC_DMAStop(DAC_HandleTypeDef* hdac)
{
	//TODO
	return HAL_OK;

};
HAL_StatusTypeDef HAL_DAC_Mute(DAC_HandleTypeDef* hdac)
{
	//TODO
	return HAL_OK;

};
HAL_StatusTypeDef HAL_DAC_UnMute(DAC_HandleTypeDef* hdac)
{
	//TODO
	return HAL_OK;

};


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
__weak void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
